app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
      <%= link_to book_favorites_path(book), method: :delete do %> <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
        <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
  　　<%= link_to book_favorites_path(book), method: :post do %><i class="fas fa-heart"　aria-hidden="true"></i>
        <%= book.favorites.count %>