app/views/users/followers.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
---
      <td><%= user.name %></td>
      <td>フォロー数：<%= user.active_relationships.count %></td>
      <td>フォロワー数：<%= user.passive_relationships.count %></td>