app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <% @books.each do |book| %>
            <% user = User.find(book.user_id) %>