app/views/books/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <% @books.each do |book| %>
              <% user = User.find(book.user_id) %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]
---
                </td>
                <td>コメント数：<%= book.book_comments.count %></td>