app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @newbook = Book.new
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all.order(updated_at: :asc)
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sas"], ["body", "aa"], ["user_id", 1], ["created_at", "2021-11-12 11:48:58.848035"], ["updated_at", "2021-11-12 11:48:58.848035"]]
SELECT "books".* FROM "books" ORDER BY "books"."updated_at" ASC