app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2021-11-15 08:16:18.790426"], ["updated_at", "2021-11-15 08:16:18.790426"]]
---
  def create
    follow = current_user.active_relationships.build(follower_id: params[:user_id])
    follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy