app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books.order(updated_at: :asc)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."updated_at" ASC  [["user_id", 1]]